In [1]:
import sqlite3

In [2]:
#connect with database
db =sqlite3.connect("my_database.db")

In [3]:
# declare cursor
cursor=db.cursor()

In [14]:
#create table
cursor.execute("CREATE TABLE E_list3(e_id INT PRIMARY KEY,name TEXT,f_name TEXT,department TEXT,salary INT,age INT,experience INT)")

In [15]:
#insert table
cursor.execute("INSERT INTO E_list3(e_id,name,f_name,department,salary,age,experience) values(100,'sachin','satish','data_scientist',80000,25,5),(101,'ajay','balwan','salesman',50000,30,4),(102,'jatin','sonu','cse',60000,24,8),(103,'sahil','sachin','cse',40000,29,2),(104,'rohit','balwan','data_scientist',60000,30,11),(105,'sahil','vishal','plumber',30000,21,1),(106,'aashish','sunil','mea',55000,30,3),(107,'reena','sumit','it',68000,35,8),(108,'meena','subhash','it',45000,29,5),(109,'suumit','rohit','mechanic',34000,37,11),(110,'sagar','rk khanna','cse',75000,39,14),(111,'vaibhav','ajay','mea',86000,31,6),(112,'rahul','kuldeep','it',34000,27,3),(113,'aakash','ajay saini','it',66000,36,7),(114,'mohit','amit','cse',69000,41,9),(115,'aakash','nerendra','mea',79000,36,6),(116,'aasu','rajnath','data_scientist',59000,35,7),(117,'amit_rohilla','manohar','mechanic',33000,38,8),(118,'aaryan','sonu','cse',39000,33,9),(119,'anshu','ravinder','it',89000,40,15),(120,'shubham','satish','it',77000,36,9),(121,'sahil','ravinder','mechanic',68000,41,20),(122,'aloop','sachin','it',20000,23,1),(123,'vaibhav','sachin','mechanic',43000,34,7),(124,'tannu','bhupendra','mea',63000,34,8),(125,'monit','krishan','data_scientist',111000,45,16),(126,'chetna','krishan','mea',88000,44,12)")

In [16]:
#save data permanently
db.commit()

In [17]:
print(cursor.rowcount,"record(s) inserted")

27 record(s) inserted

In [18]:
#select data
cursor.execute("SELECT* FROM E_list3")

In [19]:
my_data=cursor.fetchall()
for data in my_data:
    print(data)

(100, 'sachin', 'satish', 'data_scientist', 80000, 25, 5)
(101, 'ajay', 'balwan', 'salesman', 50000, 30, 4)
(102, 'jatin', 'sonu', 'cse', 60000, 24, 8)
(103, 'sahil', 'sachin', 'cse', 40000, 29, 2)
(104, 'rohit', 'balwan', 'data_scientist', 60000, 30, 11)
(105, 'sahil', 'vishal', 'plumber', 30000, 21, 1)
(106, 'aashish', 'sunil', 'mea', 55000, 30, 3)
(107, 'reena', 'sumit', 'it', 68000, 35, 8)
(108, 'meena', 'subhash', 'it', 45000, 29, 5)
(109, 'suumit', 'rohit', 'mechanic', 34000, 37, 11)
(110, 'sagar', 'rk khanna', 'cse', 75000, 39, 14)
(111, 'vaibhav', 'ajay', 'mea', 86000, 31, 6)
(112, 'rahul', 'kuldeep', 'it', 34000, 27, 3)
(113, 'aakash', 'ajay saini', 'it', 66000, 36, 7)
(114, 'mohit', 'amit', 'cse', 69000, 41, 9)
(115, 'aakash', 'nerendra', 'mea', 79000, 36, 6)
(116, 'aasu', 'rajnath', 'data_scientist', 59000, 35, 7)
(117, 'amit_rohilla', 'manohar', 'mechanic', 33000, 38, 8)
(118, 'aaryan', 'sonu', 'cse', 39000, 33, 9)
(119, 'anshu', 'ravinder', 'it', 89000, 40, 15)
(120, 'shubham', 'satish', 'it', 77000, 36, 9)
(121, 'sahil', 'ravinder', 'mechanic', 68000, 41, 20)
(122, 'aloop', 'sachin', 'it', 20000, 23, 1)
(123, 'vaibhav', 'sachin', 'mechanic', 43000, 34, 7)
(124, 'tannu', 'bhupendra', 'mea', 63000, 34, 8)
(125, 'monit', 'krishan', 'data_scientist', 111000, 45, 16)
(126, 'chetna', 'krishan', 'mea', 88000, 44, 12)

In [21]:
my_data =cursor.execute("SELECT e_id FROM E_list3")
for x in my_data:
    print(x)

(100,)
(101,)
(102,)
(103,)
(104,)
(105,)
(106,)
(107,)
(108,)
(109,)
(110,)
(111,)
(112,)
(113,)
(114,)
(115,)
(116,)
(117,)
(118,)
(119,)
(120,)
(121,)
(122,)
(123,)
(124,)
(125,)
(126,)

In [22]:
my_data = cursor.execute("SELECT age FROM E_list3")
for x in my_data:
    print(x)

(25,)
(30,)
(24,)
(29,)
(30,)
(21,)
(30,)
(35,)
(29,)
(37,)
(39,)
(31,)
(27,)
(36,)
(41,)
(36,)
(35,)
(38,)
(33,)
(40,)
(36,)
(41,)
(23,)
(34,)
(34,)
(45,)
(44,)

In [24]:
my_data = cursor.execute("SELECT f_name,experience FROM E_list3")
for x in my_data:
    print(x)

('satish', 5)
('balwan', 4)
('sonu', 8)
('sachin', 2)
('balwan', 11)
('vishal', 1)
('sunil', 3)
('sumit', 8)
('subhash', 5)
('rohit', 11)
('rk khanna', 14)
('ajay', 6)
('kuldeep', 3)
('ajay saini', 7)
('amit', 9)
('nerendra', 6)
('rajnath', 7)
('manohar', 8)
('sonu', 9)
('ravinder', 15)
('satish', 9)
('ravinder', 20)
('sachin', 1)
('sachin', 7)
('bhupendra', 8)
('krishan', 16)
('krishan', 12)

In [44]:
my_data =cursor.execute("SELECT department FROM E_list3 ")
my_data.fetchall()

[('data_scientist',),
 ('salesman',),
 ('cse',),
 ('cse',),
 ('data_scientist',),
 ('plumber',),
 ('mea',),
 ('it',),
 ('it',),
 ('mechanic',),
 ('cse',),
 ('mea',),
 ('it',),
 ('it',),
 ('cse',),
 ('mea',),
 ('data_scientist',),
 ('mechanic',),
 ('cse',),
 ('it',),
 ('it',),
 ('mechanic',),
 ('it',),
 ('mechanic',),
 ('mea',),
 ('data_scientist',),
 ('mea',)]

# where

In [25]:
my_data = cursor.execute("SELECT name FROM E_list3 where e_id =120")
for x in my_data:
    print(x)

('shubham',)

In [27]:
my_data = cursor.execute("SELECT name,department FROM E_list3 where e_id =110")
for x in my_data:
    print(x)

('sagar', 'cse')

In [28]:
my_data = cursor.execute("SELECT*FROM E_list3 where e_id =125")
for x in my_data:
    print(x)

(125, 'monit', 'krishan', 'data_scientist', 111000, 45, 16)

In [29]:
my_data = cursor.execute("SELECT*FROM E_list3 where e_id =125")
my_data.fetchone()

(125, 'monit', 'krishan', 'data_scientist', 111000, 45, 16)

In [33]:
my_data = cursor.execute("SELECT*FROM E_list3 where e_id in (100,109,112,118,122)")
for x in my_data:
     print(x)

(100, 'sachin', 'satish', 'data_scientist', 80000, 25, 5)
(109, 'suumit', 'rohit', 'mechanic', 34000, 37, 11)
(112, 'rahul', 'kuldeep', 'it', 34000, 27, 3)
(118, 'aaryan', 'sonu', 'cse', 39000, 33, 9)
(122, 'aloop', 'sachin', 'it', 20000, 23, 1)

In [34]:
my_data = cursor.execute("SELECT * FROM E_list3 where age between 28 and 35")
my_data.fetchall()

[(101, 'ajay', 'balwan', 'salesman', 50000, 30, 4),
 (103, 'sahil', 'sachin', 'cse', 40000, 29, 2),
 (104, 'rohit', 'balwan', 'data_scientist', 60000, 30, 11),
 (106, 'aashish', 'sunil', 'mea', 55000, 30, 3),
 (107, 'reena', 'sumit', 'it', 68000, 35, 8),
 (108, 'meena', 'subhash', 'it', 45000, 29, 5),
 (111, 'vaibhav', 'ajay', 'mea', 86000, 31, 6),
 (116, 'aasu', 'rajnath', 'data_scientist', 59000, 35, 7),
 (118, 'aaryan', 'sonu', 'cse', 39000, 33, 9),
 (123, 'vaibhav', 'sachin', 'mechanic', 43000, 34, 7),
 (124, 'tannu', 'bhupendra', 'mea', 63000, 34, 8)]

In [35]:
my_data = cursor.execute("SELECT * FROM E_list3 where salary between 30000 and 50000")
my_data.fetchall()

[(101, 'ajay', 'balwan', 'salesman', 50000, 30, 4),
 (103, 'sahil', 'sachin', 'cse', 40000, 29, 2),
 (105, 'sahil', 'vishal', 'plumber', 30000, 21, 1),
 (108, 'meena', 'subhash', 'it', 45000, 29, 5),
 (109, 'suumit', 'rohit', 'mechanic', 34000, 37, 11),
 (112, 'rahul', 'kuldeep', 'it', 34000, 27, 3),
 (117, 'amit_rohilla', 'manohar', 'mechanic', 33000, 38, 8),
 (118, 'aaryan', 'sonu', 'cse', 39000, 33, 9),
 (123, 'vaibhav', 'sachin', 'mechanic', 43000, 34, 7)]

In [36]:
my_data = cursor.execute("SELECT * FROM E_list3 where salary between 30000 and 50000")
for x in my_data:
    print(x)

(101, 'ajay', 'balwan', 'salesman', 50000, 30, 4)
(103, 'sahil', 'sachin', 'cse', 40000, 29, 2)
(105, 'sahil', 'vishal', 'plumber', 30000, 21, 1)
(108, 'meena', 'subhash', 'it', 45000, 29, 5)
(109, 'suumit', 'rohit', 'mechanic', 34000, 37, 11)
(112, 'rahul', 'kuldeep', 'it', 34000, 27, 3)
(117, 'amit_rohilla', 'manohar', 'mechanic', 33000, 38, 8)
(118, 'aaryan', 'sonu', 'cse', 39000, 33, 9)
(123, 'vaibhav', 'sachin', 'mechanic', 43000, 34, 7)

In [37]:
my_data = cursor.execute("SELECT * FROM E_list3 where age>25 and age<30")
my_data.fetchall()

[(103, 'sahil', 'sachin', 'cse', 40000, 29, 2),
 (108, 'meena', 'subhash', 'it', 45000, 29, 5),
 (112, 'rahul', 'kuldeep', 'it', 34000, 27, 3)]

In [38]:
my_data = cursor.execute("SELECT * FROM E_list3 where age>=25 and age<=30")
my_data.fetchall()

[(100, 'sachin', 'satish', 'data_scientist', 80000, 25, 5),
 (101, 'ajay', 'balwan', 'salesman', 50000, 30, 4),
 (103, 'sahil', 'sachin', 'cse', 40000, 29, 2),
 (104, 'rohit', 'balwan', 'data_scientist', 60000, 30, 11),
 (106, 'aashish', 'sunil', 'mea', 55000, 30, 3),
 (108, 'meena', 'subhash', 'it', 45000, 29, 5),
 (112, 'rahul', 'kuldeep', 'it', 34000, 27, 3)]

# ascending order

In [40]:
my_data = cursor.execute("SELECT * FROM E_list3 order by name asc")
my_data.fetchall()

[(113, 'aakash', 'ajay saini', 'it', 66000, 36, 7),
 (115, 'aakash', 'nerendra', 'mea', 79000, 36, 6),
 (118, 'aaryan', 'sonu', 'cse', 39000, 33, 9),
 (106, 'aashish', 'sunil', 'mea', 55000, 30, 3),
 (116, 'aasu', 'rajnath', 'data_scientist', 59000, 35, 7),
 (101, 'ajay', 'balwan', 'salesman', 50000, 30, 4),
 (122, 'aloop', 'sachin', 'it', 20000, 23, 1),
 (117, 'amit_rohilla', 'manohar', 'mechanic', 33000, 38, 8),
 (119, 'anshu', 'ravinder', 'it', 89000, 40, 15),
 (126, 'chetna', 'krishan', 'mea', 88000, 44, 12),
 (102, 'jatin', 'sonu', 'cse', 60000, 24, 8),
 (108, 'meena', 'subhash', 'it', 45000, 29, 5),
 (114, 'mohit', 'amit', 'cse', 69000, 41, 9),
 (125, 'monit', 'krishan', 'data_scientist', 111000, 45, 16),
 (112, 'rahul', 'kuldeep', 'it', 34000, 27, 3),
 (107, 'reena', 'sumit', 'it', 68000, 35, 8),
 (104, 'rohit', 'balwan', 'data_scientist', 60000, 30, 11),
 (100, 'sachin', 'satish', 'data_scientist', 80000, 25, 5),
 (110, 'sagar', 'rk khanna', 'cse', 75000, 39, 14),
 (103, 'sahil', 'sachin', 'cse', 40000, 29, 2),
 (105, 'sahil', 'vishal', 'plumber', 30000, 21, 1),
 (121, 'sahil', 'ravinder', 'mechanic', 68000, 41, 20),
 (120, 'shubham', 'satish', 'it', 77000, 36, 9),
 (109, 'suumit', 'rohit', 'mechanic', 34000, 37, 11),
 (124, 'tannu', 'bhupendra', 'mea', 63000, 34, 8),
 (111, 'vaibhav', 'ajay', 'mea', 86000, 31, 6),
 (123, 'vaibhav', 'sachin', 'mechanic', 43000, 34, 7)]

In [41]:
my_data = cursor.execute("SELECT * FROM E_list3 order by salary asc")
my_data.fetchall()

[(122, 'aloop', 'sachin', 'it', 20000, 23, 1),
 (105, 'sahil', 'vishal', 'plumber', 30000, 21, 1),
 (117, 'amit_rohilla', 'manohar', 'mechanic', 33000, 38, 8),
 (109, 'suumit', 'rohit', 'mechanic', 34000, 37, 11),
 (112, 'rahul', 'kuldeep', 'it', 34000, 27, 3),
 (118, 'aaryan', 'sonu', 'cse', 39000, 33, 9),
 (103, 'sahil', 'sachin', 'cse', 40000, 29, 2),
 (123, 'vaibhav', 'sachin', 'mechanic', 43000, 34, 7),
 (108, 'meena', 'subhash', 'it', 45000, 29, 5),
 (101, 'ajay', 'balwan', 'salesman', 50000, 30, 4),
 (106, 'aashish', 'sunil', 'mea', 55000, 30, 3),
 (116, 'aasu', 'rajnath', 'data_scientist', 59000, 35, 7),
 (102, 'jatin', 'sonu', 'cse', 60000, 24, 8),
 (104, 'rohit', 'balwan', 'data_scientist', 60000, 30, 11),
 (124, 'tannu', 'bhupendra', 'mea', 63000, 34, 8),
 (113, 'aakash', 'ajay saini', 'it', 66000, 36, 7),
 (107, 'reena', 'sumit', 'it', 68000, 35, 8),
 (121, 'sahil', 'ravinder', 'mechanic', 68000, 41, 20),
 (114, 'mohit', 'amit', 'cse', 69000, 41, 9),
 (110, 'sagar', 'rk khanna', 'cse', 75000, 39, 14),
 (120, 'shubham', 'satish', 'it', 77000, 36, 9),
 (115, 'aakash', 'nerendra', 'mea', 79000, 36, 6),
 (100, 'sachin', 'satish', 'data_scientist', 80000, 25, 5),
 (111, 'vaibhav', 'ajay', 'mea', 86000, 31, 6),
 (126, 'chetna', 'krishan', 'mea', 88000, 44, 12),
 (119, 'anshu', 'ravinder', 'it', 89000, 40, 15),
 (125, 'monit', 'krishan', 'data_scientist', 111000, 45, 16)]

# decending order

In [43]:
my_data = cursor.execute("SELECT * FROM E_list3 order by name desc")
my_data.fetchall()

[(111, 'vaibhav', 'ajay', 'mea', 86000, 31, 6),
 (123, 'vaibhav', 'sachin', 'mechanic', 43000, 34, 7),
 (124, 'tannu', 'bhupendra', 'mea', 63000, 34, 8),
 (109, 'suumit', 'rohit', 'mechanic', 34000, 37, 11),
 (120, 'shubham', 'satish', 'it', 77000, 36, 9),
 (103, 'sahil', 'sachin', 'cse', 40000, 29, 2),
 (105, 'sahil', 'vishal', 'plumber', 30000, 21, 1),
 (121, 'sahil', 'ravinder', 'mechanic', 68000, 41, 20),
 (110, 'sagar', 'rk khanna', 'cse', 75000, 39, 14),
 (100, 'sachin', 'satish', 'data_scientist', 80000, 25, 5),
 (104, 'rohit', 'balwan', 'data_scientist', 60000, 30, 11),
 (107, 'reena', 'sumit', 'it', 68000, 35, 8),
 (112, 'rahul', 'kuldeep', 'it', 34000, 27, 3),
 (125, 'monit', 'krishan', 'data_scientist', 111000, 45, 16),
 (114, 'mohit', 'amit', 'cse', 69000, 41, 9),
 (108, 'meena', 'subhash', 'it', 45000, 29, 5),
 (102, 'jatin', 'sonu', 'cse', 60000, 24, 8),
 (126, 'chetna', 'krishan', 'mea', 88000, 44, 12),
 (119, 'anshu', 'ravinder', 'it', 89000, 40, 15),
 (117, 'amit_rohilla', 'manohar', 'mechanic', 33000, 38, 8),
 (122, 'aloop', 'sachin', 'it', 20000, 23, 1),
 (101, 'ajay', 'balwan', 'salesman', 50000, 30, 4),
 (116, 'aasu', 'rajnath', 'data_scientist', 59000, 35, 7),
 (106, 'aashish', 'sunil', 'mea', 55000, 30, 3),
 (118, 'aaryan', 'sonu', 'cse', 39000, 33, 9),
 (113, 'aakash', 'ajay saini', 'it', 66000, 36, 7),
 (115, 'aakash', 'nerendra', 'mea', 79000, 36, 6)]

# NULL

In [45]:
my_data = cursor.execute("SELECT * FROM E_list3 where experience is null")
my_data.fetchall()

[]

In [46]:
my_data = cursor.execute("SELECT * FROM E_list3 where experience is  not null")
my_data.fetchall()

[(100, 'sachin', 'satish', 'data_scientist', 80000, 25, 5),
 (101, 'ajay', 'balwan', 'salesman', 50000, 30, 4),
 (102, 'jatin', 'sonu', 'cse', 60000, 24, 8),
 (103, 'sahil', 'sachin', 'cse', 40000, 29, 2),
 (104, 'rohit', 'balwan', 'data_scientist', 60000, 30, 11),
 (105, 'sahil', 'vishal', 'plumber', 30000, 21, 1),
 (106, 'aashish', 'sunil', 'mea', 55000, 30, 3),
 (107, 'reena', 'sumit', 'it', 68000, 35, 8),
 (108, 'meena', 'subhash', 'it', 45000, 29, 5),
 (109, 'suumit', 'rohit', 'mechanic', 34000, 37, 11),
 (110, 'sagar', 'rk khanna', 'cse', 75000, 39, 14),
 (111, 'vaibhav', 'ajay', 'mea', 86000, 31, 6),
 (112, 'rahul', 'kuldeep', 'it', 34000, 27, 3),
 (113, 'aakash', 'ajay saini', 'it', 66000, 36, 7),
 (114, 'mohit', 'amit', 'cse', 69000, 41, 9),
 (115, 'aakash', 'nerendra', 'mea', 79000, 36, 6),
 (116, 'aasu', 'rajnath', 'data_scientist', 59000, 35, 7),
 (117, 'amit_rohilla', 'manohar', 'mechanic', 33000, 38, 8),
 (118, 'aaryan', 'sonu', 'cse', 39000, 33, 9),
 (119, 'anshu', 'ravinder', 'it', 89000, 40, 15),
 (120, 'shubham', 'satish', 'it', 77000, 36, 9),
 (121, 'sahil', 'ravinder', 'mechanic', 68000, 41, 20),
 (122, 'aloop', 'sachin', 'it', 20000, 23, 1),
 (123, 'vaibhav', 'sachin', 'mechanic', 43000, 34, 7),
 (124, 'tannu', 'bhupendra', 'mea', 63000, 34, 8),
 (125, 'monit', 'krishan', 'data_scientist', 111000, 45, 16),
 (126, 'chetna', 'krishan', 'mea', 88000, 44, 12)]

# like operator (%)

 d%d means choose only those name start with d and end with d   eg :david
 
 %d means end with d
 
 _d% means second letter of name is d
 
 __d% means 2 letter before d 
 
 %ee%  eg :reena ,teena

In [50]:
my_data =cursor.execute("SELECT* FROM E_list3 where name like 'aa%' ")
my_data.fetchall()

[(106, 'aashish', 'sunil', 'mea', 55000, 30, 3),
 (113, 'aakash', 'ajay saini', 'it', 66000, 36, 7),
 (115, 'aakash', 'nerendra', 'mea', 79000, 36, 6),
 (116, 'aasu', 'rajnath', 'data_scientist', 59000, 35, 7),
 (118, 'aaryan', 'sonu', 'cse', 39000, 33, 9)]

In [51]:
my_data =cursor.execute("SELECT* FROM E_list3 where name like '_a%' ")
my_data.fetchall()

[(100, 'sachin', 'satish', 'data_scientist', 80000, 25, 5),
 (102, 'jatin', 'sonu', 'cse', 60000, 24, 8),
 (103, 'sahil', 'sachin', 'cse', 40000, 29, 2),
 (105, 'sahil', 'vishal', 'plumber', 30000, 21, 1),
 (106, 'aashish', 'sunil', 'mea', 55000, 30, 3),
 (110, 'sagar', 'rk khanna', 'cse', 75000, 39, 14),
 (111, 'vaibhav', 'ajay', 'mea', 86000, 31, 6),
 (112, 'rahul', 'kuldeep', 'it', 34000, 27, 3),
 (113, 'aakash', 'ajay saini', 'it', 66000, 36, 7),
 (115, 'aakash', 'nerendra', 'mea', 79000, 36, 6),
 (116, 'aasu', 'rajnath', 'data_scientist', 59000, 35, 7),
 (118, 'aaryan', 'sonu', 'cse', 39000, 33, 9),
 (121, 'sahil', 'ravinder', 'mechanic', 68000, 41, 20),
 (123, 'vaibhav', 'sachin', 'mechanic', 43000, 34, 7),
 (124, 'tannu', 'bhupendra', 'mea', 63000, 34, 8)]

In [52]:
my_data =cursor.execute("SELECT* FROM E_list3 where name like '%c%' ")
my_data.fetchall()

[(100, 'sachin', 'satish', 'data_scientist', 80000, 25, 5),
 (126, 'chetna', 'krishan', 'mea', 88000, 44, 12)]

In [53]:
my_data =cursor.execute("SELECT* FROM E_list3 where age like '%5' ")
my_data.fetchall()

[(100, 'sachin', 'satish', 'data_scientist', 80000, 25, 5),
 (107, 'reena', 'sumit', 'it', 68000, 35, 8),
 (116, 'aasu', 'rajnath', 'data_scientist', 59000, 35, 7),
 (125, 'monit', 'krishan', 'data_scientist', 111000, 45, 16)]

In [54]:
my_data =cursor.execute("SELECT* FROM E_list3 where salary like '55%' ")
my_data.fetchall()

[(106, 'aashish', 'sunil', 'mea', 55000, 30, 3)]

In [58]:
my_data= cursor.execute("SELECT * FROM E_list3 where department not in ('data_scientist')")
my_data.fetchall()

[(101, 'ajay', 'balwan', 'salesman', 50000, 30, 4),
 (102, 'jatin', 'sonu', 'cse', 60000, 24, 8),
 (103, 'sahil', 'sachin', 'cse', 40000, 29, 2),
 (105, 'sahil', 'vishal', 'plumber', 30000, 21, 1),
 (106, 'aashish', 'sunil', 'mea', 55000, 30, 3),
 (107, 'reena', 'sumit', 'it', 68000, 35, 8),
 (108, 'meena', 'subhash', 'it', 45000, 29, 5),
 (109, 'suumit', 'rohit', 'mechanic', 34000, 37, 11),
 (110, 'sagar', 'rk khanna', 'cse', 75000, 39, 14),
 (111, 'vaibhav', 'ajay', 'mea', 86000, 31, 6),
 (112, 'rahul', 'kuldeep', 'it', 34000, 27, 3),
 (113, 'aakash', 'ajay saini', 'it', 66000, 36, 7),
 (114, 'mohit', 'amit', 'cse', 69000, 41, 9),
 (115, 'aakash', 'nerendra', 'mea', 79000, 36, 6),
 (117, 'amit_rohilla', 'manohar', 'mechanic', 33000, 38, 8),
 (118, 'aaryan', 'sonu', 'cse', 39000, 33, 9),
 (119, 'anshu', 'ravinder', 'it', 89000, 40, 15),
 (120, 'shubham', 'satish', 'it', 77000, 36, 9),
 (121, 'sahil', 'ravinder', 'mechanic', 68000, 41, 20),
 (122, 'aloop', 'sachin', 'it', 20000, 23, 1),
 (123, 'vaibhav', 'sachin', 'mechanic', 43000, 34, 7),
 (124, 'tannu', 'bhupendra', 'mea', 63000, 34, 8),
 (126, 'chetna', 'krishan', 'mea', 88000, 44, 12)]

In [59]:
my_data= cursor.execute("SELECT * FROM E_list3 where department not in ('it')")
my_data.fetchall()

[(100, 'sachin', 'satish', 'data_scientist', 80000, 25, 5),
 (101, 'ajay', 'balwan', 'salesman', 50000, 30, 4),
 (102, 'jatin', 'sonu', 'cse', 60000, 24, 8),
 (103, 'sahil', 'sachin', 'cse', 40000, 29, 2),
 (104, 'rohit', 'balwan', 'data_scientist', 60000, 30, 11),
 (105, 'sahil', 'vishal', 'plumber', 30000, 21, 1),
 (106, 'aashish', 'sunil', 'mea', 55000, 30, 3),
 (109, 'suumit', 'rohit', 'mechanic', 34000, 37, 11),
 (110, 'sagar', 'rk khanna', 'cse', 75000, 39, 14),
 (111, 'vaibhav', 'ajay', 'mea', 86000, 31, 6),
 (114, 'mohit', 'amit', 'cse', 69000, 41, 9),
 (115, 'aakash', 'nerendra', 'mea', 79000, 36, 6),
 (116, 'aasu', 'rajnath', 'data_scientist', 59000, 35, 7),
 (117, 'amit_rohilla', 'manohar', 'mechanic', 33000, 38, 8),
 (118, 'aaryan', 'sonu', 'cse', 39000, 33, 9),
 (121, 'sahil', 'ravinder', 'mechanic', 68000, 41, 20),
 (123, 'vaibhav', 'sachin', 'mechanic', 43000, 34, 7),
 (124, 'tannu', 'bhupendra', 'mea', 63000, 34, 8),
 (125, 'monit', 'krishan', 'data_scientist', 111000, 45, 16),
 (126, 'chetna', 'krishan', 'mea', 88000, 44, 12)]

# delete record

NameError: name 'cursor' is not defined

In [4]:
sql =cursor.execute("DELETE FROM E_list3 WHERE e_id =105")
for x in sql:
    print(x)

NameError: name 'cursor' is not defined

In [1]:
sql =cursor.execute("DELETE * FROM E_list3 WHERE e_id =105")
db.commit()
data = cursor.execute("SELECT*FROM E_list3")
data.fetchall()

NameError: name 'cursor' is not defined